# Data cleaning assignment


1.Introduction
This assignment will help you to consolidate the concepts learnt in the session.
2.Problem Statement
It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

#creating dataframe first

In [390]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',

            '12. Air France', '"Swiss Air"']})

# Given dataframe

In [391]:

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [392]:
df.dtypes[df.dtypes=='object']

From_To         object
RecentDelays    object
Airline         object
dtype: object

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

code::

In [393]:

 
df.FlightNumber[1]=10055
df.FlightNumber[3]=10075
df.FlightNumber=df.FlightNumber.astype(int)

df

G:\Anacondapy\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
G:\Anacondapy\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame

code:

In [394]:

temporary_df=df['From_To'].str.split('_',expand=True)
column_name=['From','To']
temporary_df.columns=column_name
print("TEMPORARY DATA FRAME")
temporary_df

TEMPORARY DATA FRAME

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn


3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

code::

In [395]:

a=[i.capitalize() for i in temporary_df['From']]
b=[i.capitalize() for i in temporary_df['To']]
temporary_df['From']=a
temporary_df['To'] =b
temporary_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London


4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

code:

In [396]:
df.drop(['From_To'],axis=1,inplace=True)
df=pd.concat([temporary_df,df],axis=1)

print("DATAFRAME AFTER ADDING TEMPORARY DATAFRAME")
df

DATAFRAME AFTER ADDING TEMPORARY DATAFRAME

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

code:

In [397]:
a=df['RecentDelays']
import numpy as np 

for i in a:
    b=(3-len(i))
    for j in range(b):
            i.append(np.nan)
x=[]
y=[]
z=[]

for i in a:
    x.append(i[0])
    y.append(i[1])
    z.append(i[2])


delays=pd.DataFrame({'delay_1':x,'delay_2':y,'delay_3':z})
print("DELAY DATAFRAME")
delays

DELAY DATAFRAME

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [398]:

df.drop(['RecentDelays'],axis=1,inplace=True)
df=pd.concat([df,delays],axis=1)
print("FINAL DATAFRAME AFTER REMOVING RecentDelay COULMN DROM df AND ADDING DELAY DATAFRAME")
df

FINAL DATAFRAME AFTER REMOVING RecentDelay COULMN DROM DF AND ADDING DELAY DATAFRAME

,From,To,FlightNumber,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN